# создай игру "угадай число". В коде программы в переменную записываете любое число от 1 до 100
# которое и должен угадать игрок. Далее программа должна спросить у игрока число. Если пользователь
# не угадал число - программа сообщает, что значение числа больше\меньше и предлагает попробовать еще раз,
# при этом программа ведет счет количества попыток игрока. Если игрок угадал число, тогдапрограмма благодарит
# за игру и сообщает количество попыток, за которые было угаданно число.


print('Добро пожаловать в иру угадай число, введите число от 1 до 100')
