# 1) дан список получить новый список в котором каждое значение будет удвоено
#  [1,2,3] --> [2,4,6]

# 2) дан список возвести в квадрат каждий из его элементов и получить сумму всех полученных вариантов
# [1,2,3] --> 14 -->1^2 +2^2 +3^2 =14

# 3) игорь любит кататься на велосипеде он знает что при этом важно не допустить обезвоживания и пьет по 0,5 л в час. 
# Вам дается время в часах, ивам нужно вернуть воличество литров, которые Игорь выпьет, с округлением до наименьшего значения 
# time1 = 3 --> liters +1
# time2 = 6.7 --> liters =3
# time3 = 11.8 --> liters =5

# 4) Hello world!! проверить, есть ли в этой строке символ пробела - " ",тогда 
# преобразовать все символы к верхнему регистру, если нет тогда к нижнему 
# s= 'Hello world'
# if stm:
#     pass #условие которое ничего не выполняет, и не возвращает ошибок!!!
# else:
#     pass
#*********************1******************
l1 = [1,2,3]

# print(l1)
# l2 = (l1[0]*2, l1[1]*2, l1[2]*2)
# print (l2)
# *******************2***************

# print(l1)
# l2 = (l1[0]**2, l1[1]**2, l1[2]**2)
# print (l2)
# x= (l2[0] + l2[1] + l2[2])
# print (x)
# *******************3*********************
x=3
y=0.5
z=y*x
if z 
print (z)


# while x
# print (x/0.5)
# *******************4********************
s= 'hello world'

for l in s
    if == '':
    print(s.capitalize())
# else:
    # pass



