x=1 # переменная х = 1 переменная хранит какие то данные.
y=3.5 # коробка которая хранит чтото, название коробки y = (символ присваивания)
            #данные хранятся в оперативной памяти и указывают на ячейку данных
            # эти данные можно всегда поменять
my_var1=50      #для имени переменной допускаются буквы цыфры _ и начинается с букв
_myvar1=100     # не допускается 1_myvar1 !!
myVar=30        

print(type(x))
print(type(y))

X=2
print(x, X) # вывод двух разных переменных, регистр имете значение

TEST = 20 # переменная псевдо константата(что-то не изменное)
print (TEST)
TEST = 40 
print (TEST)
